app/controllers/courses_controller.rb

	def index
		if params[:name].blank?
			if params[:teacher].blank?
				if params[:time].blank?
					@courses=Course.all
				end
			end
		end
		if params[:name].present?
			if params[:teacher].present?
				if params[:time].present?
					@courses = Course.where(name:params[:name]).where(teacher:params[:teacher]).where(time:params[:time])
				end
				if params[:time].blank?
					@courses = Course.where(name:params[:name]).where(teacher:params[:teacher])
				end
			end
			if params[:teacher].blank?
				if params[:time].present?
					@courses = Course.where(name:params[:name]).where(time:params[:time])
				end
				if params[:time].blank?
					@courses = Course.where(name:params[:name])
---
SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" WHERE "courses"."time" = ? AND "courses"."name" = ? AND "courses"."teacher" = ?  [["time", "5"], ["name", "test2"], ["teacher", "lin"]]
SELECT "courses".* FROM "courses" WHERE "courses"."name" = ? AND "courses"."teacher" = ?  [["name", "economics"], ["teacher", ""]]
SELECT "courses".* FROM "courses" WHERE "courses"."name" = ? AND "courses"."time" = ?  [["name", "economics"], ["time", "3567"]]
SELECT "courses".* FROM "courses" WHERE "courses"."name" = ?  [["name", "test"]]

					@courses = Course.where(teacher:params[:teacher]).where(time:params[:time])
				end
				if params[:time].blank?
					@courses = Course.where(teacher:params[:teacher])
---
SELECT "courses".* FROM "courses" WHERE "courses"."teacher" = ?  [["teacher", "lin"]]

		if params[:name].blank?
			if params[:teacher].blank?
				if params[:time].present?
					@courses = Course.where(time:params[:time])
---
SELECT "courses".* FROM "courses" WHERE "courses"."time" = ?  [["time", "3567"]]

	def create
  		Course.create(course_params)
---
INSERT INTO "courses" ("name", "teacher", "classroom", "time", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "test"], ["teacher", "1"], ["classroom", "2"], ["time", "3"], ["score", "4"], ["created_at", "2015-04-04 11:17:13.406774"], ["updated_at", "2015-04-04 11:17:13.406774"]]

	def update
		@course = Course.find(params[:id])
  		@course.update_attributes(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "courses" SET "time" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["time", "3567"], ["updated_at", "2015-04-05 01:25:19.007320"], ["id", 6]]